{"config": [{"config": {"function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-7-ce7eb70a325a>\u00da\b<lambda>\b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "dim_ordering": "tf", "border_mode": "valid", "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "linear", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "subsample": [1, 1], "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_2", "dim_ordering": "tf", "border_mode": "valid", "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "linear", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "subsample": [1, 1], "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_3", "dim_ordering": "tf", "border_mode": "valid", "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "linear", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "subsample": [1, 1], "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "same", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "dim_ordering": "tf", "border_mode": "valid", "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "linear", "nb_row": 3, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_5", "dim_ordering": "tf", "border_mode": "valid", "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "linear", "nb_row": 3, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "input_dim": 1152, "activation": "relu", "b_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "input_dim": 100, "activation": "relu", "b_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "input_dim": 50, "activation": "relu", "b_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "input_dim": 10, "activation": "linear", "b_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}